loadTesting/getArtillery.yml
config:
  target: 'http://localhost:3000'
  processor: "./artillery-get-functions.js"
  phases:
    - duration: 60
      arrivalRate: 1
  defaults:
    headers:
      x-my-service-auth: ''
scenarios:
    - flow:
        - loop:
            - function: "generateRandomData"
            - get:
                url: "{{ areacode }}"
          count: 200